{
  "SettingsPage": {
    "title": "Einstellungen"
  },
  "Navbar": {},
  "TaskPane": {
    "header": "WOIDE - Eine Word OMDoc IDE",
    "description": "WOIDE ist ein Tool, das semantische Annotationen in Microsoft Office Word ermöglicht. Nutzen Sie seine Funktionen, um aktive Dokumente und mehr zu erstellen.",
    "sub-desc1": "Erfahren Sie hier, wie Sie WOIDE verwenden:",
    "sub-desc2": "Sehen Sie sich WOIDE II auf GitHub an",
    "annotationType": "Annotationstyp",
    "red": "Rot",
    "blue": "Blau",
    "green": "Grün",
    "addText": "Text hinzufügen",
    "testing": "Testen",
    "test1": "Test 1",
    "test2": "Test 2",
    "test3": "Test 3",
    "output": "Ausgabe"
  },
  "form": {
    "selectAnnotation": {
      "_name": "Annotations Wähler",
      "notice": "Markieren Sie den Start-Tag einer Annotation und klicken Sie den 'Auswählen' Knopf oder geben Sie unten die ID der Annotation ein.",
      "select": "Auswählen"
    }
  },
  "Home": {
    "article": "# Was ist WOIDE?\n\n## Eine Word OMDoc IDE\n\nWOIDE ist ein Plugin, dass die notwendige Funktionalität bietet, um semantische Annotationen in Microsoft Word-Dokumenten\nzu erstellen. Es dient als Proof of Concept und wurde als Microsoft Word-Variante von sTeX entwickelt, das derzeit nur\nfür LaTeX verfügbar ist.\n\nMit WOIDE können Benutzer Annotationen erstellen, löschen und nach SHTML (semantisches HTML) exportieren. Zusätzlich\nkönnen Annotations-Tags zwischen drei verschiedenen Anzeigetypen umgeschaltet werden.\n\n## Eine Lösung für allgemeine Annotationsaufgaben in Word\n\nWOIDE ist nicht nur auf sTeX-Annotationen beschränkt. Mit dem dynamischen Annotationstyp-Editor können Benutzer eigene\nAnnotationstypen definieren und sie in jedes string-basierte Format exportieren — einschließlich des\nWord-Dokumenteninhalts als HTML.\n\n# Installation\n\n1. Laden Sie die `manifest.xml`-Datei von [https://woide.kwarc.info/manifest.xml](https://woide.kwarc.info/manifest.xml)\n   herunter\n    - Sie kann heruntergeladen werden, indem der Link im Browser geöffnet und die Seite gespeichert wird (z.B. mit\n      `Strg + s`)\n2. Öffnen Sie ein neues Word-Dokument und suchen Sie die Schaltfläche \"Add-Ins\"\n3. Klicken Sie anschließend auf \"Erweitert\"\n4. Klicken Sie dann auf \"Mein Add-In hochladen\" in der oberen rechten Ecke\n5. Nun sollte ein Fenster sichtbar sein, in dem die zuvor heruntergeladene `manifest.xml`-Datei gefunden werden kann\n6. WOIDE-II sollte jetzt in Ihre Word-Instanz geladen werden - viel Spaß!\n\n# Open-Source\n\nWOIDE ist Open Source und unter der GNU GPL-3.0 lizenziert. Das Repository finden\nSie [hier](https://github.com/aurelius-adrian/WOIDE-II)\n\n# Entwicklung und Forschung\n\nWOIDE ist eine Entwicklung im Rahmen meines Informatikstudiums an der Friedrich-Alexander-Universität Erlangen-Nürnberg.\nMeinen Bericht über die Entwicklung des WOIDE-Prototyps können\nSie [hier](https://gl.kwarc.info/supervision/projectarchive/-/blob/master/2024/Adrian_Aurelius.pdf) lesen."
  }
}
