{
  "SettingsPage":{
    "title": "Settings"
  },
  "Navbar": {},
  "TaskPane":{
    "header": "WOIDE - A Word OMDoc IDE",
    "description":"WOIDE is a tool, which brings semantic annotation to Microsoft Office Word. Use its features to create active documents and more.",
    "sub-desc1": "Learn how to use WOIDE here:",
    "sub-desc2": "See WOIDE II on GitHub",
    "annotationType": "Annotation Type",
    "red": "Red",
    "blue": "Blue",
    "green": "Green",
    "addText": "Add Text",
    "testing": "Testing",
    "test1": "Test 1",
    "test2": "Test 2",
    "test3": "Test 3",
    "output": "Output"
  },
  "form": {
    "selectAnnotation": {
      "_name": "Annotation Selector",
      "notice": "Select the start tag of a annotation and click on the 'Select' button or enter the ID of the annotation below.",
      "select": "Select"
    }
  },
  "Home": {
    "article": "# What is WOIDE?\n\n## A Word OMDoc IDE\nWOIDE is a plugin that provides the functionality needed to create semantic annotations within Microsoft Word documents. It serves as a proof of concept, developed as a Microsoft Word variant of sTeX, which is currently only available for LaTeX.\n\nWith WOIDE, users can create, delete, and export annotations to SHTML (semantic HTML). Additionally, annotation tags can be toggled between three distinct display types.\n\n## A Solution for General Annotation Tasks in Word\nWOIDE is not limited to sTeX-style annotations. Its dynamic annotation type editor allows users to define custom annotation types and export them to any string-based format — including the Word document's content as HTML.\n\n# Installation\n\n1. Download the `manifest.xml` file found at [https://woide.kwarc.info/manifest.xml](https://woide.kwarc.info/manifest.xml)\n   - It can be downloaded by opening the link within the browser and saving the page (e.g. with `ctrl + s`)\n2. Open a new Word Document and locate the \"Add-Ins\" button\n3. Next click on \"advanced\"\n4. Next click on \"Upload My Add-In\" in the top right corner\n5. Now a Window should be visible in which the previously downloaded `manifest.xml` file can be found\n6. WOIDE-II should now load into your Word instance - have fun!\n\n# Open-Source\n\nWOIDE is open source and licenced under GNU GPL-3.0. The repository can be found [here](https://github.com/aurelius-adrian/WOIDE-II)\n\n# Development and Research\n\nWOIDE is a development as a part of my computer science studies at Friedrich-Alexander-Universität Erlangen-Nürnberg. \nYou can read my report on the development of the WOIDE prototype [here](https://gl.kwarc.info/supervision/projectarchive/-/blob/master/2024/Adrian_Aurelius.pdf)."
  }
}